app/views/questions/_questions.html.erb


<% @quiz.questions.each do |question| %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = ?  [["quiz_id", 1]]