app/controllers/attempts_controller.rb

	def new
		@quiz = Quiz.find(params[:quiz_id])
		@user = current_user

		results = Attempt.where(:user_id => @user.id, :quiz_id => @quiz.id)

		if results.count==0
			@attempt = Attempt.new()
			@attempt.user = current_user
			@attempt.quiz = @quiz
			@attempt.save

			@attempt.state += 1
			@attempt.save

			q = Question.where(:qno => @attempt.state, :quiz_id => @quiz.id)
---
SELECT "attempts".* FROM "attempts" WHERE "attempts"."user_id" = ? AND "attempts"."quiz_id" = ?  [["user_id", 22], ["quiz_id", 7]]
SELECT COUNT(*) FROM "attempts" WHERE "attempts"."user_id" = ? AND "attempts"."quiz_id" = ?  [["user_id", 22], ["quiz_id", 7]]
INSERT INTO "attempts" ("user_id", "quiz_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 22], ["quiz_id", 7], ["created_at", "2017-09-20 10:23:49.020553"], ["updated_at", "2017-09-20 10:23:49.020553"]]
SELECT "questions".* FROM "questions" WHERE "questions"."qno" = ? AND "questions"."quiz_id" = ?  [["qno", 1], ["quiz_id", 7]]

			@attempt = Attempt.new()
			@attempt.user = current_user
			@attempt.quiz = @quiz
			@attempt.save
---
UPDATE "attempts" SET "state" = ?, "updated_at" = ? WHERE "attempts"."id" = ?  [["state", 1], ["updated_at", "2017-09-20 11:01:10.324429"], ["id", 11]]

	def edit
		@quiz = Quiz.find(params[:quiz_id])
		@user = current_user

		results = Attempt.where(:user_id => @user.id, :quiz_id => @quiz.id)

		if results.count==0

			@attempt = Attempt.new()
			@attempt.user = current_user
			@attempt.quiz = @quiz
			@attempt.save

			@attempt.state += 1
			@attempt.save

			q = Question.where(:qno => @attempt.state, :quiz_id => @quiz.id)
---
SELECT "attempts".* FROM "attempts" WHERE "attempts"."user_id" = ? AND "attempts"."quiz_id" = ?  [["user_id", 22], ["quiz_id", 9]]
SELECT COUNT(*) FROM "attempts" WHERE "attempts"."user_id" = ? AND "attempts"."quiz_id" = ?  [["user_id", 22], ["quiz_id", 9]]
INSERT INTO "attempts" ("user_id", "quiz_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 22], ["quiz_id", 9], ["created_at", "2017-09-21 13:48:03.283220"], ["updated_at", "2017-09-21 13:48:03.283220"]]
SELECT "questions".* FROM "questions" WHERE "questions"."qno" = ? AND "questions"."quiz_id" = ?  [["qno", 1], ["quiz_id", 9]]