app/controllers/questions_controller.rb

INSERT INTO "questions" ("ques_name", "optionA", "optionB", "optionC", "optionD", "quiz_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["ques_name", ""], ["optionA", ""], ["optionB", ""], ["optionC", ""], ["optionD", ""], ["quiz_id", 1], ["created_at", "2017-09-19 14:31:10.804894"], ["updated_at", "2017-09-19 14:31:10.804894"]]
UPDATE "questions" SET "qno" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["qno", 1], ["updated_at", "2017-09-19 20:41:35.068964"], ["id", 9]]
---
	def create
		@quiz = Quiz.find(params[:quiz_id])
		@question = @quiz.questions.create(question_params)
		num =  @quiz.numquestions + 1
		puts num
		@quiz.update_attributes(:numquestions => num)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
	def show
		puts params
		@question = Question.find(params[:id])

SELECT "attempts".* FROM "attempts" WHERE "attempts"."user_id" = ? AND "attempts"."quiz_id" = ?  [["user_id", 22], ["quiz_id", 9]]
SELECT "questions".* FROM "questions" WHERE "questions"."qno" = ? AND "questions"."quiz_id" = ?  [["qno", 1], ["quiz_id", 9]]
---
	def next
		@quiz = Quiz.find(params[:quiz_id])
		@user = current_user

		results = Attempt.where(:user_id => @user.id, :quiz_id => @quiz.id)

		@att = results[0]

		stat = @att.state

		q = Question.where(:qno => stat, :quiz_id => @quiz.id)